Public Attributes | List of all members
API_RailingHorizontalPosData Struct Reference
Element Manager API
Represents the horizontal alignment of a Railing subelement. More...
#include <APIdefs_Elements.h>
 Public Attributes
double  | position
The horizontal position of the element.
bool  | isStretchable
True, if the element can be stretched.
Detailed Description
Represents the horizontal alignment of a Railing subelement.
Member Data Documentation
◆ isStretchable
 API_RailingHorizontalPosData::isStretchable
True, if the element can be stretched.
◆ position
 API_RailingHorizontalPosData::position
The horizontal position of the element.